#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.automation: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation]
azurerm_policy_definition.allowed_regions: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-regions]
module.sandbox-1.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1]
module.sandbox-2.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2]
azurerm_policy_definition.require_mfa: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/require-mfa]
data.azurerm_subscription.current: Reading...
azurerm_cost_anomaly_alert.cost_anomaly_alert: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.CostManagement/scheduledActions/cost-anomaly-alert]
azurerm_policy_definition.allowed_vm_sizes: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-vm-sizes]
azurerm_policy_definition.storage_encryption: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/enforce-storage-encryption]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1]
module.sandbox-2.azurerm_network_security_group.nsg_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-public]
module.sandbox-2.azurerm_network_security_group.nsg_private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private]
module.sandbox-2.azurerm_virtual_network.sandbox_vnet: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet]
azurerm_automation_account.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account]
module.sandbox-2.azurerm_consumption_budget_subscription.sandbox_budget: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Consumption/budgets/sandbox-budget-sandbox-2]
module.sandbox-1.azurerm_network_security_group.nsg_private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private]
module.sandbox-1.azurerm_virtual_network.sandbox_vnet: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet]
module.sandbox-1.azurerm_consumption_budget_subscription.sandbox_budget: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Consumption/budgets/sandbox-budget-sandbox-1]
module.sandbox-1.azurerm_network_security_group.nsg_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-public]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["enforce-storage-encryption"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/enforce-storage-encryption-assignment-sandbox-2]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["require-mfa"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/require-mfa-assignment-sandbox-2]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["allowed-regions"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/allowed-regions-assignment-sandbox-2]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["allowed-vm-sizes"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/allowed-vm-sizes-assignment-sandbox-2]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["require-mfa"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/require-mfa-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["allowed-regions"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/allowed-regions-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["allowed-vm-sizes"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/allowed-vm-sizes-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["enforce-storage-encryption"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/enforce-storage-encryption-assignment-sandbox-1]
module.sandbox-2.azurerm_subnet.public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-2.azurerm_subnet.private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_subnet.private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_subnet.public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-1.azurerm_network_security_rule.deny_private_outbound_all: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Deny-All-Outbound]
module.sandbox-2.azurerm_network_security_rule.deny_private_outbound_all: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Deny-All-Outbound]
module.sandbox-2.azurerm_subnet_network_security_group_association.private_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_subnet_network_security_group_association.public_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-1.azurerm_network_security_rule.allow_private_to_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Allow-Private-to-Public]
module.sandbox-2.azurerm_subnet_network_security_group_association.public_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-2.azurerm_network_security_rule.allow_private_to_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Allow-Private-to-Public]
module.sandbox-1.azurerm_subnet_network_security_group_association.private_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_automation_schedule.daily: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/schedules/daily-runbook-schedule-sandbox-1]
module.sandbox-2.azurerm_automation_schedule.daily: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/schedules/daily-runbook-schedule-sandbox-2]
module.sandbox-1.azurerm_automation_runbook.shutdown_vms: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/runbooks/shutdown-vms-sandbox-1]
module.sandbox-2.azurerm_automation_runbook.shutdown_vms: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/runbooks/shutdown-vms-sandbox-2]
module.sandbox-2.azurerm_automation_job_schedule.daily_runbook: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/schedules/daily-runbook-schedule-sandbox-2|/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/runbooks/shutdown-vms-sandbox-2]
module.sandbox-1.azurerm_automation_job_schedule.daily_runbook: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/schedules/daily-runbook-schedule-sandbox-1|/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/automation/providers/Microsoft.Automation/automationAccounts/test-automation-account/runbooks/shutdown-vms-sandbox-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sandbox-3.azurerm_automation_job_schedule.daily_runbook will be created
  + resource "azurerm_automation_job_schedule" "daily_runbook" {
      + automation_account_name = "test-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "automation"
      + resource_manager_id     = (known after apply)
      + runbook_name            = "shutdown-vms-sandbox-3"
      + schedule_name           = "daily-runbook-schedule-sandbox-3"
    }

  # module.sandbox-3.azurerm_automation_runbook.shutdown_vms will be created
  + resource "azurerm_automation_runbook" "shutdown_vms" {
      + automation_account_name = "test-automation-account"
      + content                 = <<-EOT
            try {
                "Logging in to Azure..."
                Connect-AzAccount -Identity
            }
            catch {
                Write-Error -Message $_.Exception
                throw $_.Exception
            }
                
            $ResourceGroupName = "sandbox-3"
                
            $day = (Get-Date).DayOfWeek
            if ($day -eq "Saturday" -or $day -eq "Sunday") {
                Write-Output "It's $day, shutting down running VMs in $ResourceGroupName..."
                
                $runningVMs = Get-AzVM -ResourceGroupName $ResourceGroupName | Where-Object { $_.PowerState -eq "VM running" }
                foreach ($vm in $runningVMs) {
                   Stop-AzVM -Name $vm.Name -ResourceGroupName $ResourceGroupName -Force
                }
            }
            else {
                Write-Output "Today is $day. No shutdown required."
            }
        EOT
      + description             = "Runbook to shutdown running VMs on weekends."
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "eastus"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "shutdown-vms-sandbox-3"
      + resource_group_name     = "automation"
      + runbook_type            = "PowerShell"
    }

  # module.sandbox-3.azurerm_automation_schedule.daily will be created
  + resource "azurerm_automation_schedule" "daily" {
      + automation_account_name = "test-automation-account"
      + expiry_time             = (known after apply)
      + frequency               = "Day"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "daily-runbook-schedule-sandbox-3"
      + resource_group_name     = "automation"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # module.sandbox-3.azurerm_consumption_budget_subscription.sandbox_budget will be created
  + resource "azurerm_consumption_budget_subscription" "sandbox_budget" {
      + amount          = 500
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "sandbox-budget-sandbox-3"
      + subscription_id = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1"
      + time_grain      = "Monthly"

      + filter {
          + dimension {
              + name     = "ResourceGroupName"
              + operator = "In"
              + values   = [
                  + "sandbox-3",
                ]
            }
        }

      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 75
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 90
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = "2026-01-01T00:00:00Z"
          + start_date = (known after apply)
        }
    }

  # module.sandbox-3.azurerm_network_security_group.nsg_private will be created
  + resource "azurerm_network_security_group" "nsg_private" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-private"
      + resource_group_name = "sandbox-3"
      + security_rule       = (known after apply)
    }

  # module.sandbox-3.azurerm_network_security_group.nsg_public will be created
  + resource "azurerm_network_security_group" "nsg_public" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-public"
      + resource_group_name = "sandbox-3"
      + security_rule       = (known after apply)
    }

  # module.sandbox-3.azurerm_network_security_rule.allow_private_to_public will be created
  + resource "azurerm_network_security_rule" "allow_private_to_public" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.1.0/24"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow-Private-to-Public"
      + network_security_group_name = "nsg-private"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "sandbox-3"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-3.azurerm_network_security_rule.deny_private_outbound_all will be created
  + resource "azurerm_network_security_rule" "deny_private_outbound_all" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Deny-All-Outbound"
      + network_security_group_name = "nsg-private"
      + priority                    = 200
      + protocol                    = "*"
      + resource_group_name         = "sandbox-3"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.sandbox-3.azurerm_resource_group.sandbox will be created
  + resource "azurerm_resource_group" "sandbox" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "sandbox-3"
    }

  # module.sandbox-3.azurerm_resource_group_policy_assignment.policies["allowed-regions"] will be created
  + resource "azurerm_resource_group_policy_assignment" "policies" {
      + enforce              = true
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "allowed-regions-assignment-sandbox-3"
      + policy_definition_id = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-regions"
      + resource_group_id    = (known after apply)
    }

  # module.sandbox-3.azurerm_resource_group_policy_assignment.policies["allowed-vm-sizes"] will be created
  + resource "azurerm_resource_group_policy_assignment" "policies" {
      + enforce              = true
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "allowed-vm-sizes-assignment-sandbox-3"
      + policy_definition_id = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-vm-sizes"
      + resource_group_id    = (known after apply)
    }

  # module.sandbox-3.azurerm_resource_group_policy_assignment.policies["enforce-storage-encryption"] will be created
  + resource "azurerm_resource_group_policy_assignment" "policies" {
      + enforce              = true
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "enforce-storage-encryption-assignment-sandbox-3"
      + policy_definition_id = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/enforce-storage-encryption"
      + resource_group_id    = (known after apply)
    }

  # module.sandbox-3.azurerm_resource_group_policy_assignment.policies["require-mfa"] will be created
  + resource "azurerm_resource_group_policy_assignment" "policies" {
      + enforce              = true
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "require-mfa-assignment-sandbox-3"
      + policy_definition_id = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/require-mfa"
      + resource_group_id    = (known after apply)
    }

  # module.sandbox-3.azurerm_subnet.private will be created
  + resource "azurerm_subnet" "private" {
      + address_prefixes                              = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-private"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "sandbox-3"
      + virtual_network_name                          = "SandboxVNet"
    }

  # module.sandbox-3.azurerm_subnet.public will be created
  + resource "azurerm_subnet" "public" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-public"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "sandbox-3"
      + virtual_network_name                          = "SandboxVNet"
    }

  # module.sandbox-3.azurerm_subnet_network_security_group_association.private_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "private_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.sandbox-3.azurerm_subnet_network_security_group_association.public_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "public_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.sandbox-3.azurerm_virtual_network.sandbox_vnet will be created
  + resource "azurerm_virtual_network" "sandbox_vnet" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "SandboxVNet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "sandbox-3"
      + subnet                         = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @VasuWip, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*